Abbavanna/MSP430/DLTM_MSP430 _FR.c
#define LEDb            (BIT2)      // green LEDb on P2.2
#define LEDg            (BIT1)      // blue  LEDg on P2.1
#define PULSOUT         (BIT3)      //Ausgang zum Pulsgenerator
#define Y_STEP          (BIT5)      //Ausgang zum Y-Schrittmotor
#define Y_DIR           (BIT4)      //Ausgang zum Y-Schrittmotor
#define INTENSITY       (BIT4)      //Input from detector of reflected light (original: diff. bitstream signal)

#define POSYMAX         0x0000ffff  //maximale Y-Position

#define I2C_ack         0
#define I2C_nack        1
#define Address         0
#define DEVICE_CODE     0xC0U

#define GENERAL_CALL    0x00U
#define RESET           0x06U
#define WAKEUP          0x09U
#define UPDATE          0x08U
#define READADDRESS     0x0CU
#define READRESTART     0xC1U

#define FASTWRITE       0x00U   // update input DAC registers from channels A to D sequentially
#define MULTIWRITE      0x40U   // write DAC input register, one at a time
#define SEQWRITE        0x50U   // writes DAC input registers and EEPROM sequentially from starting ch.to D
#define SINGLEWRITE     0x58U   // writes selected single DAC input register and EEPROM

#define WRITEADDRESS    0x60U
#define WRITECURRENT    0x61U
#define WRITENEW        0x62U
#define WRITECONFIRM    0x63U

#define WRITEVREF       0x80U
#define WRITEPD         0xA0U
#define WRITEGAIN       0xC0U
//----------------------------

/* unsigned short ADCdata[3];  //buffer for ADC-values
    unsigned long  SysTick=0;    //milliseconds counter
    unsigned short PulsFreq=1;  //Enable für Pulsgenerator
    unsigned short PosX=0x0800, PosZ=2240, PosT=0x0800;   //Linsenpositionsvariablen
    unsigned short PosY=2000, PosYIst=2000; //Y soll- und ist-Position
    unsigned short PosP=4096;   //SEE-Puls Intensity
    unsigned short PosF=100;    //Pulse freq
    unsigned short PosXmin=1000, PosXmax=1500, PosYmin=1000, PosYmax=1500, PosZmin=2100, PosZmax=2450,PosImin=2400; //range for scan mode  unsigned short PosXmin=2000, PosXmax=2100, PosYmin=2220, PosYmax=2400, PosZmin=2100, PosZmax=2450,PosImin=100; //range for scan mode
    unsigned short PosXstep=1, PosYstep=1, PosZstep=10,PosIstep=100, PosXdelay=100, PosYdelay=500 ;   //range for scan mode
    unsigned char uart_rx[4];       //buffer for received bytes
    unsigned short PosAltX, PosAltY, PosAltZ, PosAltT;  //previous positions
unsigned short PosAltI,PosI=2400,PosImax=3040;    //Laser-Intensity */



unsigned short ADCdata[3];  //buffer for ADC-values
unsigned long  SysTick=0;    //milliseconds counter
unsigned short PulsFreq=1;  //Enable für Pulsgenerator
unsigned short PosX=0x0800, PosZ=0x0800, PosT=0x0800;   //Linsenpositionsvariablen
unsigned short PosY=2000, PosYIst=2000; //Y soll- und ist-Position
unsigned short PosP=4096;   //SEE-Puls Intensity
unsigned short PosF=100;    //Pulse freq
unsigned short PosXmin=1000, PosXmax=1500, PosYmin=1000, PosYmax=1500, PosZmin=2100, PosZmax=2450,PosImin=3000; //range for scan mode
unsigned short PosXstep=1, PosYstep=1, PosZstep=10,PosIstep=100, PosXdelay=100, PosYdelay=500 ;   //range for scan mode
unsigned char uart_rx[4];       //buffer for received bytes
unsigned short PosAltX, PosAltY, PosAltZ, PosAltT;  //previous positions
unsigned short PosAltI,PosI=3000,PosImax=4095;   //Laser-Intensity



unsigned int steps_auto=0,SEE_FLAG=0,flage_rev=0,vol_limit=100;
unsigned char *I2C_PTxData;                     // Pointer to TX data
unsigned char I2C_TXByteCtr;
unsigned char I2C_TxData[8];    // Table of data to transmit

unsigned short max_adc_val, min_adc_val=0x03ff,avg_adc_val,best_adc_val; //AUTO FOCUS PRAMETER

enum { START='0', SET1='1', SET2='2', SET3='3', SET4='4', ACTION1='5', ACTION2='6', GET1='7', GET2='8' } uart_state;    //states of UART-state maschine
enum { MODE_MANUPOS='0', MODE_DEMO='1', MODE_SCANAREA='2', MODE_SCANPAUSE='3', MODE_SCANAREA_SEL='4', MODE_SCANAREA_SEL2='5', MODE_MULTIPULSE='6',  MODE_PARALLELSCAN='7',  MODE_MULTINSSCAN='8' ,  MODE_AUTOFOCUS='9' } mode;  //states of mode state maschine

//******************************************************************************
// General I2C State Machine ***************************************************
//******************************************************************************
typedef enum I2C_ModeEnum{
    IDLE_MODE,
    NACK_MODE,
    TX_REG_ADDRESS_MODE,
    RX_REG_ADDRESS_MODE,
    TX_DATA_MODE,
    RX_DATA_MODE,
    SWITCH_TO_RX_MODE,
    SWITHC_TO_TX_MODE,
    TIMEOUT_MODE
} I2C_Mode;

/* Used to track the state of the software state machine*/
I2C_Mode MasterMode = IDLE_MODE;

/* The Register Address/Command to use*/
uint8_t TransmitRegAddr = 0;

/* ReceiveBuffer: Buffer used to receive data in the ISR
    * RXByteCtr: Number of bytes left to receive
    * ReceiveIndex: The index of the next byte to be received in ReceiveBuffer
    * TransmitBuffer: Buffer used to transmit data in the ISR
    * TXByteCtr: Number of bytes left to transfer
    * TransmitIndex: The index of the next byte to be transmitted in TransmitBuffer
* */
uint8_t ReceiveBuffer[MAX_BUFFER_SIZE] = {0};
uint8_t RXByteCtr = 0;
uint8_t ReceiveIndex = 0;
uint8_t TransmitBuffer[MAX_BUFFER_SIZE] = {0};
uint8_t TXByteCtr = 0;
uint8_t TransmitIndex = 0;

/* I2C Write and Read Functions */
void CopyArray(uint8_t *source, uint8_t *dest, uint8_t count);

/* For slave device with dev_addr, read the data specified in slaves reg_addr.
    * The received data is available in ReceiveBuffer
    *
    * dev_addr: The slave device address.
    *           Example: MAX9611_ADDR
    * reg_addr: The register or command to send to the slave.
    *           Example: CMD_TYPE_0_SLAVE
    * count: The length of data to read
    *           Example: TYPE_0_LENGTH
*  */
I2C_Mode I2C_Master_ReadReg(uint8_t dev_addr, uint8_t reg_addr, uint8_t count)
{   /* Initialize state machine */
    MasterMode = TX_REG_ADDRESS_MODE;
    TransmitRegAddr = reg_addr;
    RXByteCtr = count;
    TXByteCtr = 0;
    ReceiveIndex = 0;
    TransmitIndex = 0;

    /* Initialize slave address and interrupts */
    UCB0I2CSA = dev_addr;
    IFG2 &= ~(UCB0TXIFG + UCB0RXIFG);       // Clear any pending interrupts
    IE2 &= ~UCB0RXIE;                       // Disable RX interrupt
    IE2 |= UCB0TXIE;                        // Enable TX interrupt

    UCB0CTL1 |= UCTR + UCTXSTT;             // I2C TX, start condition
    __bis_SR_register(CPUOFF + GIE);              // Enter LPM0 w/ interrupts

