Abbavanna/MSP430/DLTM_MSP430 _FR.c
    return MasterMode;
}

/* For slave device with dev_addr, writes the data specified in *reg_data
    *
    * dev_addr: The slave device address.
    *           Example: MAX9611_ADDR
    * reg_addr: The register or command to send to the slave.
    *           Example: CMD_TYPE_0_MASTER
    * *reg_data: The buffer to write
    *           Example: MasterType0
    * count: The length of *reg_data
    *           Example: TYPE_0_LENGTH
*  */
I2C_Mode I2C_Master_WriteReg(uint8_t dev_addr, uint8_t reg_addr, uint8_t *reg_data, uint8_t count)
{
    /* Initialize state machine */
    MasterMode = TX_REG_ADDRESS_MODE;
    TransmitRegAddr = reg_addr;

    //Copy register data to TransmitBuffer
    CopyArray(reg_data, TransmitBuffer, count);

    TXByteCtr = count;
    RXByteCtr = 0;
    ReceiveIndex = 0;
    TransmitIndex = 0;

    /* Initialize slave address and interrupts */
    UCB0I2CSA = dev_addr;
    IFG2 &= ~(UCB0TXIFG + UCB0RXIFG);       // Clear any pending interrupts
    IE2 &= ~UCB0RXIE;                       // Disable RX interrupt
    IE2 |= UCB0TXIE;                        // Enable TX interrupt

    UCB0CTL1 |= UCTR + UCTXSTT;             // I2C TX, start condition
    __bis_SR_register(CPUOFF + GIE);              // Enter LPM0 w/ interrupts

    return MasterMode;
}

void CopyArray(uint8_t *source, uint8_t *dest, uint8_t count)
{
    uint8_t copyIndex = 0;
    for (copyIndex = 0; copyIndex < count; copyIndex++)
    {   dest[copyIndex] = source[copyIndex];
    }
}
//---------- UART FIFO -------------
#define FIFO_MEM_SIZE   8
#define FIFO_MASK       FIFO_MEM_SIZE - 1
#define uint8_t unsigned char
typedef struct
{   uint8_t read;
    uint8_t write;
}FIFO_CTRL_t;
static FIFO_CTRL_t fifo_ctrl;
static uint8_t fifo_mem[FIFO_MEM_SIZE];

void fifo_init();
uint8_t fifo_add(uint8_t chr);
uint8_t fifo_get(uint8_t *chr);

void fifo_init()
{
    fifo_ctrl.read = 0;
    fifo_ctrl.write = 0;
}

uint8_t fifo_add(uint8_t chr)
{
    if((fifo_ctrl.write & FIFO_MASK) != (fifo_ctrl.read & FIFO_MASK)
    || fifo_ctrl.write == fifo_ctrl.read)
    {
        fifo_mem[fifo_ctrl.write & FIFO_MASK] = chr;
        fifo_ctrl.write++;
        return 0;
    }
    return 1;
}

uint8_t fifo_get(uint8_t *chr)
{   if(fifo_ctrl.read != fifo_ctrl.write)
    {
        *chr = fifo_mem[fifo_ctrl.read & FIFO_MASK];
        fifo_ctrl.read++;
        return 0;
    }
    return 1;
}
//---------- UART FIFO end -------------

//Andreas - fun - begin
void delayms(unsigned int ms)
{   unsigned int i = 0;
    for (i = 0; i < ms; ++i)
    {   delay(1600);
    }
}

void initMAX9611()
{
    #ifdef MAX9611DISABLED
        return;
    #endif
    I2C_Master_WriteReg(MAX9611_ADDR, CMD_CTL1_SLAVE, CR1_CSA_Gain1, TYPE_0_LENGTH);  //Set Gain
    delayms(100);
    I2C_Master_WriteReg(MAX9611_ADDR, CMD_CTL1_SLAVE, CR1_FRM, TYPE_0_LENGTH);    //Set Channel
    delayms(100);
    I2C_Master_WriteReg(MAX9611_ADDR, CMD_CTL2_SLAVE, CR2, TYPE_0_LENGTH);    //Set MAX9611 WDT-Settings
    delayms(100);
    I2C_Master_ReadReg(MAX9611_ADDR, CMD_CSAMSB_SLAVE, 12);
    delayms(10);
}

unsigned short readMAX9611_current()    //Read current and return mA
{
    #ifdef MAX9611DISABLED
        return 0x5A;
    #endif
    unsigned short current;
    I2C_Master_ReadReg(MAX9611_ADDR, CMD_CSAMSB_SLAVE, 2); //read first two registers from MAX9611
    current = (((unsigned short)ReceiveBuffer[1] & 0xFF) >> 4) | (((unsigned short)ReceiveBuffer[0] & 0xFF) << 4); //shift registers to unsigned short
    current = current*CURRENT_CALIBRATION_CONSTANT_Gain1; //with calibration
    //UART_TX((unsigned char)(current & 0xFF) );    //send measured current for debugging
    return current;
}

unsigned short readMAX9611_voltage()    //Read voltage and returns value in 10mV
{
    #ifdef MAX9611DISABLED
        return 0xA5;
    #endif
    unsigned short voltage;
    I2C_Master_ReadReg(MAX9611_ADDR, CMD_RSMSB_SLAVE, 2); //read first two registers from MAX9611
    voltage = (((unsigned short)ReceiveBuffer[1] & 0xFF) >> 4) | (((unsigned short)ReceiveBuffer[0] & 0xFF) << 4); //shift registers to unsigned short
    voltage = voltage*VOLTAGE_CALIBRATION_CONSTANT; //with calibration
    //UART_TX((unsigned char)(current & 0xFF) );    //send measured voltage for debugging
    return voltage;
}
#define MCP4728WriteVref    (1<<7)
#define MCP4728WritePowerDown   (1<<7)+(1<<5)
#define MCP4728WriteGainSelect  (1<<7)+(1<<6)

void initMCP4728()  //initialize DAC -nicht gebraucht, wird bei jeder Wertaktualisierung (nur MultiWrite) mit übergeben
{   I2C_Master_WriteReg(MCP4728_ADDR, MCP4728WriteVref + 0x0F, 0, 0);  //Set Vref=2,048V intern

    //I2C_Master_WriteReg(MCP4728_ADDR, MCP4728WriteVref + 0x00, 0, 0);  //Set Vref=Vcc
    //I2C_Master_WriteReg(MCP4728_ADDR, MCP4728WriteGainSelect + 0x00, 0, 0);  //Set Gain=1
    I2C_Master_WriteReg(MCP4728_ADDR, MCP4728WriteGainSelect + 0x0F, 0, 0);  //Set Gain=2
    //delayms(100);
}

// Schreibt Werte in alle 4 DAC-Kanäle
//Vref+Gain wird hier nicht mit übergeben
//MCP4728_FastWrite(chan0, chan1, chan2, chan3);
//MCP4728_FastWrite(Y, Z, T, X);
void MCP4728_FastWrite(unsigned short chan0, unsigned short chan1, unsigned short chan2, unsigned short chan3)
{
    #ifdef MCP4728DISABLED
        return;
    #endif
    I2C_TxData[0]=(FASTWRITE | ((unsigned char)((chan0 >> 8) & 0x3F)));
    I2C_TxData[1]=(FASTWRITE |  (unsigned char)(chan0 & 0x00FF));
    I2C_TxData[2]=(FASTWRITE | ((unsigned char)((chan1 >> 8) & 0x3F)));
    I2C_TxData[3]=(FASTWRITE |  (unsigned char)(chan1 & 0x00FF));
    I2C_TxData[4]=(FASTWRITE | ((unsigned char)((chan2 >> 8) & 0x3F)));
    I2C_TxData[5]=(FASTWRITE |  (unsigned char)(chan2 & 0x00FF));
    I2C_TxData[6]=(FASTWRITE | ((unsigned char)((chan3 >> 8) & 0x3F)));
    I2C_TxData[7]=(FASTWRITE |  (unsigned char)(chan3 & 0x00FF));
    //I2C_write(0x60, I2C_TxData, 8); //(Adresse, Datenarray, Laenge)
    I2C_Master_WriteReg(MCP4728_ADDR, 0x00, I2C_TxData, 8);
}

#define MCP4728RefInt   0x80
#define MCP4728RefVdd   0x00
#define MCP4728Gain1    0x00
#define MCP4728Gain2    0x10
// Schreibt neuen Wert in einen DAC-Kanal
//MCP4728_MultiWrite(kanal, wert);
void MCP4728_MultiWrite(unsigned char channel, unsigned short data)
{
    #ifdef MCP4728DISABLED
        return;
    #endif
    I2C_TxData[0]=((unsigned char)((data >> 8)& 0x0f)) + MCP4728RefInt + MCP4728Gain2;
    I2C_TxData[1]=((unsigned char)(data & 0x00FF));
    I2C_Master_WriteReg(MCP4728_ADDR, (MULTIWRITE | (channel << 1)), I2C_TxData, 2);
}

