Abbavanna/MSP430/DLTM_MSP430 _FR.c
    // Initialize system +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
    initialize();
    initI2C();
    initMAX9611();  //initialize current-sense-monitor
    //initMCP4728();    //initialize DAC

    //for testing only: init SEL-Delay
    //  uart_rx[1]='u';    I2C_TxData[0]=0;    I2C_TxData[1]=4;
    //  I2C_Master_WriteReg(MSP430_SLAVE_ADDR, uart_rx[1], I2C_TxData, TYPE_1_LENGTH);

    P2OUT ^= LEDb;              // Toggle P1.0 using exclusive-OR
    P2OUT ^= LEDg;
    P2OUT &= ~LEDg;             // LED off
    // Program begin
    mode=MODE_MANUPOS;
    uart_state=START;           // zurück in Grundzustand
    enablePulsGen(PosF);        // Pulsgenerator anschalten Parameter: Frequenz(8Hz-500kHz(?))
    //unsigned short cnt=4095;
    while(1)
    {   /*if(!(SysTick%1000))
        {   MCP4728_MultiWrite(0,(cnt));// only for testing DAC (channel, data)<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
        MCP4728_MultiWrite(1,(cnt));// only for testing DAC (channel, data)<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
        MCP4728_MultiWrite(2,(cnt));// only for testing DAC (channel, data)<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
        MCP4728_MultiWrite(3,(cnt));// only for testing DAC (channel, data)<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
        //          cnt+=50;
        if(cnt>4095) cnt=0;
    }*/
    //readMAX9611_current();
    if (!fifo_get(&data))   //check if fifo-buffer not empty and read 1 byte
    {   uart0_receive(data);//empfangenes Zeichen auswerten
    }
    if(!(SysTick%1000))
    {   P2OUT |= LEDb;      // LED on
        //I2C_Master_WriteReg(MSP430_SLAVE_ADDR, uart_rx[1], I2C_TxData, TYPE_1_LENGTH);
        //delayms(1);
    }
    if((SysTick%1000)==64)
    {   P2OUT &= ~LEDb;     // LED off
    }


    if((PosAltX!=PosX) || (PosAltY!=PosY) || (PosAltI!=PosI) || (PosAltT!=PosT) || (PosAltZ!=PosZ)) //bei Positionsänderung
    {   P2OUT ^= LEDb;                          // Toggle LED when something changed
        PosAltX=PosX; PosAltY=PosY; PosAltI=PosI; PosAltT=PosT; PosAltZ=PosZ;   //alte Werte neu beschreiben
    }
    if((mode == MODE_MULTIPULSE) && (SysTick >= SysTickScanStep))       //Multi Pulse Mode
    {   SysTickScanStep = SysTick + PosXdelay;  //calculate delay
        if (PosXmax--)  //if still pulses to generate
        {   P2OUT |= PULSOUT;           // P2.3 high
            P2OUT &= ~PULSOUT;          // P2.3 low
        }
        else                //all pulses done
        {   mode = MODE_MANUPOS;
            MCP4728_MultiWrite(0,PosI);// back to previous intensity (channel, data)
            enablePulsGen(PosF);    //start pulse generator
            SendACK();          //Bestaetigung antworten
        }
    }
    if((mode == MODE_SCANAREA) && (SysTick >= SysTickScanStep))     //Surface Scan Modus
    {   P2OUT |= PULSOUT;                   // P2.3 high
        P2OUT &= ~PULSOUT;                  // P2.3 low
        readSingleADC();                    // read out internal ADC to get intensity value
        UART_TX(0xff-(char)(ADC10MEM>>2));  //ADCdata[0]);    //send PixelIntensityData (from ADC channel 4)
        SysTickScanStep = setNextScanPos();                   //move to next X-pos and set new waiting-time
    }
    if((mode == MODE_SCANAREA_SEL) && (SysTick >= SysTickScanStep))     //SEL Scan Modus
    {   P2OUT |= PULSOUT;                   // P2.3 high
        P2OUT &= ~PULSOUT;                  // P2.3 low
        mode = MODE_SCANAREA_SEL2;

        SysTickScanStep = SysTick + 10;     //wait for new adc conversion (2*2ms(conv time)->async->nyquist) and register transfer complete

        unsigned short current;
        mode = MODE_SCANAREA_SEL;
        current = readMAX9611_current(); //read current from DUT and returns value in mA

        UART_TX((unsigned char)(current >> 8)); //transmit MSB
        UART_TX((unsigned char)current);        //transmit LSB

        //current = current / 2;
        //if(current>0xff){current=0xff;}   //limit to 8bit
        //UART_TX( (unsigned char)(current & 0xFF) );    //send measured current
        SysTickScanStep=setNextScanPos();       //move to next X-pos and set new waiting-time
        if(current>13) //wait if an SEL occours;    //Todo: make this dynamic/coupled with SEL-Delay!
        {
            SysTickScanStep+=1000;  //increase Step delay in case of Latchup (time to recover is around 800ms in ATtiny20)
        }
    }
    if((mode == MODE_PARALLELSCAN) && (SysTick >= SysTickScanStep))     //Parallel Scan Modus
    {   unsigned short reflectivity, current, voltage;
        current = readMAX9611_current(); //read current from DUT and returns value in mA
        P2OUT |= PULSOUT;                   // P2.3 high
        P2OUT &= ~PULSOUT;                  // P2.3 low
        readSingleADC();                    // read out internal ADC to get reflectivity value
        delayms(12);    // delay removed for fast scanning (!!! no current mesurement after latchup possible !!!)
        //SysTickScanStep = SysTick + 10;     //wait for new adc conversion (2*2ms(conv time)->async->nyquist) and register transfer complete
        reflectivity = 0x03ff - ADC10MEM;   //invert reflectivity value from ADC
        voltage = readMAX9611_voltage(); //read voltage from DUT and returns value in 10mV

        /*   if((0x08 & P1IN))
            voltage = 0;
            else
        voltage = 999;*/


        UART_TX((unsigned char)(reflectivity >> 8));  //transmit MSB of refletivity
        UART_TX((unsigned char)reflectivity);  //transmit LSB of reflectivity
        UART_TX((unsigned char)(current >> 8)); //transmit MSB
        UART_TX((unsigned char)current);        //transmit LSB
        UART_TX((unsigned char)(voltage >> 8)); //transmit MSB
        UART_TX((unsigned char)voltage);        //transmit LSB

