Abbavanna/MSP430/DLTM_MSP430 _FR.c
void init_scanStart(void)   //prepare to start scanning (called from uart0_receive() )
{   disablePulsGen();   //stop pulse generator
    P2SEL &= ~PULSOUT;  // set pulse-out pin to PIO-mode
    PosX = PosXmin;
    PosY = PosYmin; //initial position for scan mode
    MCP4728_MultiWrite(3, PosX);   //set X-pos (channel, data)
    UART_TX('d');
    UART_TX('a');
    UART_TX('t');
}
//----------------------------- UART stuff ---------------------------

// Meldung auf UART absetzen:
void SendACK()   //send Acknowledge
{    // # TODO: Fix real problem, delay is work around for not applying sent values
    delayms(100);
    UART_TX('a');
    UART_TX('c');
    UART_TX('k');
}
void SendERR(char message[])        //send error
{   char pos=0;
    UART_TX('e');
    UART_TX('r');
    UART_TX('r');
    while ((message[pos]!=0) && (pos<100))
    UART_TX(message[pos++]);
    UART_TX('\r');
    UART_TX('\n');
}

// Hier werden die empfangenen UART-Daten entsprechend Protokolldefinition ausgewertet:
void uart0_receive(unsigned char data)      //analyzes received UART data
{   unsigned short databuffer;              //buffer for received data
    switch (uart_state)         // Zustand der uart-Statemachine
    {   case START:         // Befehlsauswahl
        switch (data)       //empfangenen Befehl auswerten
        {   case 's':   uart_state=SET1;    break;  //set parameters
            case 'a':   uart_state=ACTION1; break;  //perform action
            case 'g':   uart_state=GET1;    break;  //get stuff from setup
            default :   SendERR("Wrong stuff received!");           //Fehler melden
        }
        break;
        case SET1:{  uart_rx[0]=data;    uart_state=SET2;    break;}  // read command
        case SET2:{  uart_rx[1]=data;    uart_state=SET3;    break;}  // read value high part
        case SET3:{  uart_rx[2]=data;    uart_state=SET4;    break;}  // read value low  part
        case SET4:{  uart_rx[3]=data;
            databuffer=((uart_rx[2]<<8)+uart_rx[3]);    //convert received databytes into 16bit value
            switch (uart_rx[0]) //select set command
            {   case 'x':   // set x-scan positions
                switch  (uart_rx[1])
                {   case 'l':   PosXmin=databuffer; break;  // set y_axis low
                    case 'h':   PosXmax=databuffer; break;  // set y_axis high
                    default:                //in case of other values
                    SendERR("SetPosition: wrong scan parameter!");      //send error
                    uart_state=START;       // zurück in Grundzustand
                }
                break;
                case 'z':   // set z-scan positions
                switch  (uart_rx[1])
                {   case 'l':   PosZmin=databuffer; break;  // set Z_axis low
                    case 'h':   PosZmax=databuffer; break;  // set Z_axis high
                    default:                //in case of other values
                    SendERR("SetPosition: wrong scan parameter!");      //send error
                    uart_state=START;       // zurück in Grundzustand
                }
                break;
                case 'y':   // set y-scan positions
                switch  (uart_rx[1])
                {   case 'l':   PosYmin=databuffer; break;  // set y_axis low
                    case 'h':   PosYmax=databuffer; break;  // set y_axis high
                    default:                //in case of other values
                    SendERR("SetPosition: wrong scan parameter!");      //send error
                    uart_state=START;       // zurück in Grundzustand
                }
                break;
                case 's':   // set scan stepsizes
                switch  (uart_rx[1])
                {   case 'x':   PosXstep=databuffer;    break;  // set scanstep in X-direction
                    case 'y':   PosYstep=databuffer;    break;  // set scanstep in Y-direction
                    case 'z':   PosZstep=databuffer;    break;  // set scanstep in Z-direction
                    case 'i':   PosIstep=databuffer;    break;  // set scanstep in Z-direction
                    default:                //in case of other values
                    SendERR("SetPosition: wrong scan parameter!");      //send error
                    uart_state=START;       // zurück in Grundzustand
                }
                break;
                case 'd':   // set delays
                switch  (uart_rx[1])
                {   case 'l':   PosYdelay=databuffer;   break;  //set line-delay
                    case 'm':   I2C_TxData[0]=databuffer>>8;
                    I2C_TxData[1]=databuffer;
                    I2C_Master_WriteReg(MSP430_SLAVE_ADDR, uart_rx[1], I2C_TxData, TYPE_1_LENGTH);
                    break; //sdm<uint16>     Set latchup-turn-off-delay in miliseconds
                    case 'u':   I2C_TxData[0]=databuffer>>8;
                    I2C_TxData[1]=databuffer;
                    I2C_Master_WriteReg(MSP430_SLAVE_ADDR, uart_rx[1], I2C_TxData, TYPE_1_LENGTH);
                    break; //sdu<uint16>      Set latchup-turn-off-delay in microseconds
                    case 'p':   PosXdelay=databuffer;   break;  //set pixel-delay
                    default:                //in case of other values
                    SendERR("SetPosition: wrong scan parameter!");      //send error
                    uart_state=START;       // zurück in Grundzustand
                }
                break;
                case 'p':   // set position
                switch  (uart_rx[1])
                {   case 'x':   MCP4728_MultiWrite(3, databuffer); PosX=databuffer;    break;//(I, Z, T, X)
                    case 't':   MCP4728_MultiWrite(2, databuffer); PosT=databuffer;    break;//(I, Z, T, X)
                    case 'z':   MCP4728_MultiWrite(1, databuffer); PosZ=databuffer;    break;//(I, Z, T, X)
                    case 'y':                                       PosY=databuffer;    break;//(I, Z, T, X)
                    default:                //Bei anderen Werten
                    SendERR("SetPosition: wrong parameter!");       //Fehler melden
                    uart_state=START;       // zurück in Grundzustand
                }
                break;
                case 'l':   // set laser parameters
                switch  (uart_rx[1])
                {   case 'i':   MCP4728_MultiWrite(0, PosI);    PosI=databuffer;    break;  // set laser intensity
                    case 'e':   PosImin=databuffer;    break;  // set min laser intensity
                    case 'g':   PosImax=databuffer;    break;  // set max laser intensity
                    case 'f':   enablePulsGen(PosF);            PosF=databuffer;    break;  // set pulse frequency
                    case 'p':                                   PosP=databuffer;    break;  // set SEE-pulse intensity
                    default:    //Bei anderen Werten
                    SendERR("SetLaser:wrong parameter!");       //Fehler melden
                    uart_state=START;       // zurück in Grundzustand
                }
                break;
                default:                //Bei anderen Werten
                SendERR("Wrong Set command received!");     //Fehler melden
                uart_state=START;       // zurück in Grundzustand
            }
            if(uart_state != START) //Wenn kein Fehler aufgetreten
            SendACK();          //answer with acknowledge
            uart_state=START;               // back to initial UART state
            break;
        }
        case GET1:
        {   uart_rx[0] = data;
            uart_state = GET2;
            break;
        }
        case GET2:
        {   uart_rx[1] = data;
            int tmpPosition = 0;
            switch (uart_rx[0])
            {   case 'd':   //DUT
                switch (uart_rx[1])
                {   case 'c':   tmpPosition = readMAX9611_current(); break; // gdc   - read current from DUT and return value in mA
                    case 'v':   tmpPosition = readMAX9611_voltage(); break; // gdv   - read voltage from DUT and return value in 10mV
                    default: uart_state = START;    break;
                }
                break;
                case 'p':
                switch (uart_rx[1])
                {   case 'x':   tmpPosition = PosX; break;  // gpx
                    case 'y':   tmpPosition = PosY; break;  // gpy
                    case 'z':   tmpPosition = PosZ; break;  // gpz
                    case 't':   tmpPosition = PosT; break;  // gpt
                    default: uart_state = START;    break;
                }
                break;
                case 'l':
                switch (uart_rx[1])
                {   case 'i':   tmpPosition = PosI; break;  // gli
                    case 'f':   tmpPosition = PosF; break;  // glf
                    case 'p':   tmpPosition = PosP; break;  // glp
                    default:    uart_state = START; break;
                }
                break;
                default:
                uart_state = START;
                break;
            }
            if (uart_state == START)
            SendERR("Wrong GET command received!");
            else
            {   UART_TX('d');
                UART_TX('a');
                UART_TX('t');
                UART_TX((char)(tmpPosition >> 8));
                UART_TX((char)tmpPosition);
                uart_state = START;
            }
            break;
        }
        case ACTION1:
        {   uart_rx[0]=data;
            uart_state=ACTION2;
            break;  // action command
        }
        case ACTION2:
        uart_rx[1] = data;
        switch (uart_rx[0])                 //action command select
        {   case 'l':                       // action laser
            switch  (uart_rx[1])
            {   case 'p':
                SEE_Puls();
                SendACK();
                uart_state = START;
                break;              // einzelnen Puls mit anderer Intensitaet rausballern
                case 'm':
                mode = MODE_MULTIPULSE; //set mode to multiple pulses
                P2SEL &= ~PULSOUT;          // P2.3 option PIO select
                MCP4728_MultiWrite(0,PosP);// SEE-Puls Intensität setzen (char channel, char data)
                delay(5000);
                disablePulsGen();   //stop pulse generator
                break;
                default:                //Bei anderen Werten
                SendERR("Wrong Laser Action command received!");        //Fehler melden
                uart_state=START;   // zurück in Grundzustand
            }
            break;
            case 's':                       // action scan
            switch  (uart_rx[1])
            {   case 'a':               // action scan area - asa
                if (mode != MODE_SCANPAUSE && mode != MODE_SCANAREA)    init_scanStart();
                // [hen] if scanning is paused, just return to scan mode
                uart_state=START;   // uart back to start condition
                mode = MODE_SCANAREA;   //set mode to scan-mode
                break;
                case 'p':               // asp: action scan pause   // [hen] added scan pause mode
                mode = MODE_SCANPAUSE;
                break;
                case 's':   mode = MODE_MANUPOS;    break;  // action scan stop - ass
                case 'l':   // action scan latchup (was scan line in older revision)
                case 'u':   //action scan latch up - asu (asu shall be removed soon -> new is asl)
                if (mode != MODE_SCANPAUSE && mode != MODE_SCANAREA_SEL)    init_scanStart();
                uart_state=START;   // uart back to start condition
                mode = MODE_SCANAREA_SEL;   //set mode to scan-mode
                case 'm': //action scan multi (scans refl., current and voltage values)
                if (mode != MODE_SCANPAUSE && mode != MODE_PARALLELSCAN)    init_scanStart();
                uart_state=START;   // uart back to start condition
                mode = MODE_PARALLELSCAN;   //set mode to scan-mode
                break;                  // action scan parallel("both")

